# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

list = [2, 3, 4, 5, 6]

prd_list = []

# a = int(len(list) / 2) - проверила, до какого индекса будет считать
# print(a)

for i in range(0, int(len(list) / 2)):
    prd_list.append(list[i] * list[len(list) - 1 - i])

if len(list) % 2 != 0:
    prd_list.append(list[i + 1] ** 2)

print(prd_list)
